slides/lecture13.org
# How to make it work with Spacemacs
# 1. Add the following to .spacemacs file
# (org :variables
#      org-enable-github-support t
#      org-enable-reveal-js-support t)
# 2. Use M-x org-reveal-export-to-html-and-browse

#+TITLE: Verification of Imperative Algorithms
#+DATE: 13.12.2019
#+AUTHOR: Anton Trunov (Zilliqa Research)
#+EMAIL: https://github.com/anton-trunov
#+OPTIONS: num:nil toc:nil timestamp:nil
#+REVEAL_TRANS: none
# none | fade | slide | convex | concave | zoom
#+REVEAL_THEME: beige
# default | beige | sky | night | serif | simple | moon
# /League/Sky/Beige/Simple/Serif/Blood/Night/Moon/Solarized
#+REVEAL_EXTRA_CSS: ./modifications.css

* Problem
- We want to prove properties of imperative algorithms, e.g.
  + Array-based quicksort
  + Union-find
  + Linked lists
  + ...
- But Coq s a purely functional language
- We need
  + to model imperative constructs and
  + a reasoning framework
* Hoare-style reasoning to the rescue
- Many interactive program verification tools are Hoare-style logic based.
- ={P} C {Q}=
- Partial correctness vs Total correctness
* Partial correctness
- If a precondition =P= holds
- _and_ program =C= terminates
- then postcondition =Q= holds
* Total correctness
- If a precondition =P= holds
- then program =C= terminates
- _and_ postcondition =Q= holds
* How do we represent programs in Coq?
- Deep embedding
- Shallow embedding
- Characteristic formulae
* Deep Embedding
Deeply embedded IMP language

#+BEGIN_SRC coq
Inductive com : Type :=
  | CSkip : com
  | CAss (v : name) (a : aexp)
  | CSeq (c1 c2 : com)
  | CIf (cond : bexp) (cthen celse : com)
  | CWhile (cond : bexp) (body : com).
#+END_SRC
  
#+BEGIN_SRC coq
Inductive aexp : Type :=
  | ANum (n : nat)
  | APlus (a1 a2 : aexp)
  | AMinus (a1 a2 : aexp)
  | AMult (a1 a2 : aexp)
#+END_SRC
* Deep Embedding
- Write code directly in this language (using Coq notations)
- Produce it as part of proof-producing synthesis (fiat-crypto)
- Import it from regular source code (clightgen for VST, CFML)
* Shallow Embedding
- Use a monad to model side-effects
  + non-termination,
  + pointers
  + ...
- Inherit the rest from Coq
- Use notations to make it look pretty
#+BEGIN_SRC coq
Notation "x '<--' c1 ';' c2" :=
  (bnd c1 (fun x => c2)) .
Notation "c1 ';;' c2" := (bnd c1 (fun _ => c2)).
#+END_SRC
* Pros of Deep embedding
- A great deal of control, which is good for performance.
- Ability to reason on relations between programs needed for
  proving the correctness of program transformations and optimizing compilers.
- Well-suited to end-to-end verification: at first, one can
  pretty-print the imperative language and use any compiler, but eventually
  one shift to a verified compiler and push the assumptions down the
  software stack.
* Cons of Deep embedding
Requires a model of the syntax and semantics of the language at a fairly low-level, including
- modeled function calls,
- variable bindings,
- local stacks,
- side effects,
- concurrency.
* Pros of Shallow embedding
Great for prototyping because one can reuse most of Coq's infrastructure
+ parsing engine
+ name binding,
+ type-checking,
+ computations.
 
Allows quick extension or modification of the embedded language.  
* Cons of Shallow embedding
- less control
- usually there is a need to extend Coq with axioms
- the expressivity of the logical calculus or a type system is limited
* What about the logic itself?
There are several different choices of how to formalize a Hoare logic in a proof assistant.
One can choose a shallow or deep embedding for formalizing
- the assertion language,
- the logic for assertion derivation,
- the Hoare logic.
 
With shallow embedding many practical proof rules are not derivable.
* The original Ynot
- Based on Hoare Type Theory
- An axiomatic extension to Coq, that supports writing, reasoning about, and extracting higher-order, dependently-typed programs with side-effects.
- Uses shallow embedding: specifications in HTT are types of monadically-typed expressions.
* Hoare Type Theory
- Incorporates Hoare-style specifications into types
- Makes it possible to statically track and enforce correct use of side effects
* Hoare Type Theory
Starts with the type theory of Coq, which already has good support for
- functional programming, inductive definitions, specifications, proofs, tactics
- extends it with a new type =ST p A q=, indexed with a pre- and a post- conditions (=p=, =q=) in addition to type =A=
* Hoare Type Theory
- =ST= classifies delayed, possibly effectful computations,
- Like the =IO=-monad classifies effectful computations in Haskell
- When a computation of type =ST p A q= is run in a heap satisfying =p=, and it
  terminates, it will produce a value of type =A= and result in a new heap such
  that the predicate =q= holds.
* Hoare Type Theory
- Computations can allocate, read, write, and deallocate locations, throw and
  catch exceptions, and perform general recursion.
- HTT makes it possible to write ML/Haskell-style programs and formally reason about them.
* The Ynot compiler
- produces object code compatible with GHC-compiled Haskell modules
- Haskell's laziness is useful since many Ynot terms have computationally irrelevant sub-terms (aux. variables)
- works in 3 stages
