slides/lecture13.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Verification of Imperative Algorithms</title>
<meta name="author" content="Anton Trunov (Zilliqa Research)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/beige.css" id="theme"/>

<link rel="stylesheet" href="./modifications.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Verification of Imperative Algorithms</h1><h2 class="author">Anton Trunov (Zilliqa Research)</h2><h2 class="date">13.12.2019</h2>
</section>

<section>
<section id="slide-orgb2b2eb8">
<h2 id="orgb2b2eb8">Problem</h2>
<ul>
<li>We want to prove properties of imperative algorithms, e.g.
<ul>
<li>Array-based quicksort</li>
<li>Union-find</li>
<li>Linked lists</li>
<li>&#x2026;</li>

</ul></li>
<li>But Coq s a purely functional language</li>
<li>We need
<ul>
<li>to model imperative constructs and</li>
<li>a reasoning framework</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-org7914558">
<h2 id="org7914558">Hoare-style reasoning to the rescue</h2>
<ul>
<li>Many interactive program verification tools are Hoare-style logic based.</li>
<li><code>{P} C {Q}</code></li>
<li>Partial correctness vs Total correctness</li>

</ul>
</section>
</section>
<section>
<section id="slide-org8ebdd1f">
<h2 id="org8ebdd1f">Partial correctness</h2>
<ul>
<li>If a precondition <code>P</code> holds</li>
<li><span class="underline">and</span> program <code>C</code> terminates</li>
<li>then postcondition <code>Q</code> holds</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgdebdc40">
<h2 id="orgdebdc40">Total correctness</h2>
<ul>
<li>If a precondition <code>P</code> holds</li>
<li>then program <code>C</code> terminates</li>
<li><span class="underline">and</span> postcondition <code>Q</code> holds</li>

</ul>
</section>
</section>
<section>
<section id="slide-org89feb84">
<h2 id="org89feb84">How do we represent programs in Coq?</h2>
<ul>
<li>Deep embedding</li>
<li>Shallow embedding</li>
<li>Characteristic formulae</li>

</ul>
</section>
</section>
<section>
<section id="slide-org3d69f67">
<h2 id="org3d69f67">Deep Embedding</h2>
<p>
Deeply embedded IMP language
</p>

<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Inductive</span> <span style="color: #bc6ec5; font-weight: bold;">com</span> : <span style="color: #ce537a; font-weight: bold;">Type</span> :=
  | CSkip : com
  | CAss <span style="color: #4f97d7;">(</span><span style="color: #7590db;">v</span> : name<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">a</span> : aexp<span style="color: #4f97d7;">)</span>
  | CSeq <span style="color: #4f97d7;">(</span><span style="color: #7590db;">c1 c2</span> : com<span style="color: #4f97d7;">)</span>
  | CIf <span style="color: #4f97d7;">(</span><span style="color: #7590db;">cond</span> : bexp<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">cthen celse</span> : com<span style="color: #4f97d7;">)</span>
  | CWhile <span style="color: #4f97d7;">(</span><span style="color: #7590db;">cond</span> : bexp<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">body</span> : com<span style="color: #4f97d7;">)</span>.
</pre>
</div>

<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Inductive</span> <span style="color: #bc6ec5; font-weight: bold;">aexp</span> : <span style="color: #ce537a; font-weight: bold;">Type</span> :=
  | ANum <span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span> : nat<span style="color: #4f97d7;">)</span>
  | APlus <span style="color: #4f97d7;">(</span><span style="color: #7590db;">a1 a2</span> : aexp<span style="color: #4f97d7;">)</span>
  | AMinus <span style="color: #4f97d7;">(</span><span style="color: #7590db;">a1 a2</span> : aexp<span style="color: #4f97d7;">)</span>
  | AMult <span style="color: #4f97d7;">(</span><span style="color: #7590db;">a1 a2</span> : aexp<span style="color: #4f97d7;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org0629a65">
<h2 id="org0629a65">Deep Embedding</h2>
<ul>
<li>Write code directly in this language (using Coq notations)</li>
<li>Produce it as part of proof-producing synthesis (fiat-crypto)</li>
<li>Import it from regular source code (clightgen for VST, CFML)</li>

</ul>
</section>
</section>
<section>
<section id="slide-org2bbab60">
<h2 id="org2bbab60">Shallow Embedding</h2>
<ul>
<li>Use a monad to model side-effects
<ul>
<li>non-termination,</li>
<li>pointers</li>
<li>&#x2026;</li>

</ul></li>
<li>Inherit the rest from Coq</li>
<li>Use notations to make it look pretty</li>

</ul>
<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Notation</span> <span style="color: #2d9574;">"x '&lt;--' c1 ';' c2"</span> :=
  <span style="color: #4f97d7;">(</span>bnd c1 <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">fun</span> <span style="color: #7590db;">x</span> =&gt; c2<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> .
<span style="color: #4f97d7; font-weight: bold;">Notation</span> <span style="color: #2d9574;">"c1 ';;' c2"</span> := <span style="color: #4f97d7;">(</span>bnd c1 <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">fun</span> <span style="color: #7590db;">_</span> =&gt; c2<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>.
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf17161d">
<h2 id="orgf17161d">Pros of Deep embedding</h2>
<ul>
<li>A great deal of control, which is good for performance.</li>
<li>Ability to reason on relations between programs needed for
proving the correctness of program transformations and optimizing compilers.</li>
<li>Well-suited to end-to-end verification: at first, one can
pretty-print the imperative language and use any compiler, but eventually
one shift to a verified compiler and push the assumptions down the
software stack.</li>

</ul>
</section>
</section>
<section>
<section id="slide-org14820d0">
<h2 id="org14820d0">Cons of Deep embedding</h2>
<p>
Requires a model of the syntax and semantics of the language at a fairly low-level, including
</p>
<ul>
<li>modeled function calls,</li>
<li>variable bindings,</li>
<li>local stacks,</li>
<li>side effects,</li>
<li>concurrency.</li>

</ul>
</section>
</section>
<section>
<section id="slide-org96a71f6">
<h2 id="org96a71f6">Pros of Shallow embedding</h2>
<p>
Great for prototyping because one can reuse most of Coq's infrastructure
</p>
<ul>
<li>parsing engine</li>
<li>name binding,</li>
<li>type-checking,</li>
<li>computations.</li>

</ul>

<p>
Allows quick extension or modification of the embedded language.  
</p>
</section>
</section>
<section>
<section id="slide-org9a2345f">
<h2 id="org9a2345f">Cons of Shallow embedding</h2>
<ul>
<li>less control</li>
<li>usually there is a need to extend Coq with axioms</li>
<li>the expressivity of the logical calculus or a type system is limited</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgad90707">
<h2 id="orgad90707">What about the logic itself?</h2>
<p>
There are several different choices of how to formalize a Hoare logic in a proof assistant.
One can choose a shallow or deep embedding for formalizing
</p>
<ul>
<li>the assertion language,</li>
<li>the logic for assertion derivation,</li>
<li>the Hoare logic.</li>

</ul>

<p>
With shallow embedding many practical proof rules are not derivable.
</p>
</section>
</section>
<section>
<section id="slide-org1e8786c">
<h2 id="org1e8786c">The original Ynot</h2>
<ul>
<li>Based on Hoare Type Theory</li>
<li>An axiomatic extension to Coq, that supports writing, reasoning about, and extracting higher-order, dependently-typed programs with side-effects.</li>
<li>Uses shallow embedding: specifications in HTT are types of monadically-typed expressions.</li>

</ul>
</section>
</section>
<section>
<section id="slide-org4f682bd">
<h2 id="org4f682bd">Hoare Type Theory</h2>
<ul>
<li>Incorporates Hoare-style specifications into types</li>
<li>Makes it possible to statically track and enforce correct use of side effects</li>

</ul>
</section>
</section>
<section>
<section id="slide-org387f5d8">
<h2 id="org387f5d8">Hoare Type Theory</h2>
<p>
Starts with the type theory of Coq, which already has good support for
</p>
<ul>
<li>functional programming, inductive definitions, specifications, proofs, tactics</li>
<li>extends it with a new type <code>ST p A q</code>, indexed with a pre- and a post- conditions (<code>p</code>, <code>q</code>) in addition to type <code>A</code></li>

</ul>
</section>
</section>
<section>
<section id="slide-org1a2398f">
<h2 id="org1a2398f">Hoare Type Theory</h2>
<ul>
<li><code>ST</code> classifies delayed, possibly effectful computations,</li>
<li>Like the <code>IO</code>-monad classifies effectful computations in Haskell</li>
<li>When a computation of type <code>ST p A q</code> is run in a heap satisfying <code>p</code>, and it
terminates, it will produce a value of type <code>A</code> and result in a new heap such
that the predicate <code>q</code> holds.</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgcc161c1">
<h2 id="orgcc161c1">Hoare Type Theory</h2>
<ul>
<li>Computations can allocate, read, write, and deallocate locations, throw and
catch exceptions, and perform general recursion.</li>
<li>HTT makes it possible to write ML/Haskell-style programs and formally reason about them.</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgb03810f">
<h2 id="orgb03810f">The Ynot compiler</h2>
<ul>
<li>produces object code compatible with GHC-compiled Haskell modules</li>
<li>Haskell's laziness is useful since many Ynot terms have computationally irrelevant sub-terms (aux. variables)</li>
<li>works in 3 stages</li>

</ul>
</section>
</section>
