slides/lecture13.org
* The Ynot compiler
Stages:
- eliminate functors and modules and normalize all of the CiC terms
- transform the CiC terms into an intermediate language, eliminating proof
  terms, inductives, and pattern matching
- transform the result into GHC Core language and compile using the GHC code
  generator
* CFML
- CFML can be used to verify _effectful_ OCaml programs using Coq
- Based on Characteristic Formulae
- CFML consists of
  + a generator that parses OCaml code and produces characteristic formulae
    expressed as Coq axioms
  + a Coq library that provides tactics for manipulating characteristic formulae
    interactively
* Characteristic Formulae
- A characteristic formula is a higher-order logic formula that fully
  characterizes the semantics of a program
- And thus and may be used to prove properties of that program
- Characteristic formulae involve specifications expressed in the style of
  Separation Logic
- Closely related to total correctness Hoare triples
* Characteristic Formulae
- CF can be viewed as an abstract layer built on top of deep embedding
- CF hide the technical details associated with the explicit representation of
  syntax while retaining the high expressiveness of that approach
* Characteristic Formulae
- CF avoid the explicit representation of syntax associated with many
  technical difficulties (e.g. representation of binders)
- Specifications can be greatly simplified because program values such as tuples
  and functional lists become directly represented with their logical
  counterpart
* Char. Formulae vs Hoare triples
- A Hoare triple ={P} C {Q}= is a 3-place relation where =C= represents the
  syntax of the program
- But =[C] P Q= is a logical proposition expressed with the standard
  higher-order connectives: =/\, \/, forall, exists=, etc.
- Hence CF can be proved without involving external derivation rules
* CFML
- To generates characteristic formulae CFML uses neither knowledge of the
  specification nor of the invariants of the source code
- The specification of each top-level definition is instead provided by the
  user, in the form of the statement of a Coq theorem
* CFML vs Ynot/HTT
- Ynot/HTT: program verification is done at the same time as type-checking the
  source code.
- CF allow verifying programs after they have been written, without
  requiring the source code to be modified in any way.
* Side effects and Coq extraction
- To get side effects in extracted code one can write an interpreter in the
  target language that runs the verified part, using the power of the target
  language to interact with the outside world via the console, filesystem,
  network, etc.
- A big disadvantage of extraction is performance. The source code is several
  steps away from the extracted code and interpreter. This distance makes it
  hard to debug performance problems and reduces control over what the
  executable code does.
* Monadic DSL for Mutable Arrays
- Suppose we only care about array-based algorithms. This already covers a wide
  area of algorithms, for example
  + the union–find data structure,
  + quicksort
- We can use a lightweight approach to formalizing imperative array-based algorithms
* Monadic DSL for Mutable Arrays
- This approach does not deal with reference cells and local states
- Uses state monad specialized for mutable array programming
- Two interpretations: for reasoning and program extraction
* Monadic DSL for Mutable Arrays
- Reduces reasoning on effectful programs to that of purely functional 
- Provides encapsulation function like =runST= of state threads
- Convertts effectful functions written in the array state monad to referential
  transparent functions and enables encapsulation of proofs.
* Representing Mutable Arrays in Coq
- State monad could be useful (=S -> S * A=), but poses some problems we'd like to avoid
- Array state monad to the rescue
  + handle multi-dimensional and multiple mutable arrays
  + never needs copy operations on arrays
* Representing Mutable Arrays in Coq
- Finite functions ={ffun I1 * · · · * In -> A}=
- Correspond to arrays of =A= indexed by =I1=,..., =In=
- Monad transformers could handle multiple arrays
- But voilate the copying restriction: composition of state monad transformer
  and the non-determinism monad yields type =S -> list (S * A)=
* Monadic DSL for Mutable Arrays
#+BEGIN_SRC coq
AState [:: (I1, T1); ...; (In, Tn)] A 
#+END_SRC
Array state monad actions with =I1=, ..., =In= indexed mutable arrays of =T1=,
..., =Tn= respectively and the return type =A=.
* Monadic DSL for Mutable Arrays
#+BEGIN_SRC coq
  Implicit Types (I J K : finType) (sig : Sign).

  Inductive AState : Sign → Type → Type :=
  | astate_ret_ : ∀ {sig} {A},
      A -> AState sig A
  | astate_bind_ : ∀ {sig} {A B},
      AState sig A ->
      (A -> AState sig B) ->
      AState sig B
#+END_SRC
* Monadic DSL for Mutable Arrays
#+BEGIN_SRC coq
  | astate_lift_ : ∀{I} {T} {sig} {A},
     AState sig A ->
     AState ((I, T) :: sig) A
#+END_SRC
The lift operator lifts array state monad actions of a signature =Σ= to that
with a signature =(I,T)::Σ=, and lifted actions does not affect the first array.
* Monadic DSL for Mutable Arrays
#+BEGIN_SRC coq
  | astate_GET_ : ∀ {I} {T} {sig},
     'I_#|I| ->
     AState ((I, T) :: sig) T
  | astate_SET_ : ∀ {I} {T} {sig},
     'I_#|I| ->
     T ->
     AState ((I, T) :: sig) unit.
#+END_SRC
Get and set operators can only access the first array.
