slides/lecture13.html
<section>
<section id="slide-org4ecc93b">
<h2 id="org4ecc93b">The Ynot compiler</h2>
<p>
Stages:
</p>
<ul>
<li>eliminate functors and modules and normalize all of the CiC terms</li>
<li>transform the CiC terms into an intermediate language, eliminating proof
terms, inductives, and pattern matching</li>
<li>transform the result into GHC Core language and compile using the GHC code
generator</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgc55ceed">
<h2 id="orgc55ceed">CFML</h2>
<ul>
<li>CFML can be used to verify <span class="underline">effectful</span> OCaml programs using Coq</li>
<li>Based on Characteristic Formulae</li>
<li>CFML consists of
<ul>
<li>a generator that parses OCaml code and produces characteristic formulae
expressed as Coq axioms</li>
<li>a Coq library that provides tactics for manipulating characteristic formulae
interactively</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-org78bfb09">
<h2 id="org78bfb09">Characteristic Formulae</h2>
<ul>
<li>A characteristic formula is a higher-order logic formula that fully
characterizes the semantics of a program</li>
<li>And thus and may be used to prove properties of that program</li>
<li>Characteristic formulae involve specifications expressed in the style of
Separation Logic</li>
<li>Closely related to total correctness Hoare triples</li>

</ul>
</section>
</section>
<section>
<section id="slide-org1548df1">
<h2 id="org1548df1">Characteristic Formulae</h2>
<ul>
<li>CF can be viewed as an abstract layer built on top of deep embedding</li>
<li>CF hide the technical details associated with the explicit representation of
syntax while retaining the high expressiveness of that approach</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd7a90f0">
<h2 id="orgd7a90f0">Characteristic Formulae</h2>
<ul>
<li>CF avoid the explicit representation of syntax associated with many
technical difficulties (e.g. representation of binders)</li>
<li>Specifications can be greatly simplified because program values such as tuples
and functional lists become directly represented with their logical
counterpart</li>

</ul>
</section>
</section>
<section>
<section id="slide-orge23f357">
<h2 id="orge23f357">Char. Formulae vs Hoare triples</h2>
<ul>
<li>A Hoare triple <code>{P} C {Q}</code> is a 3-place relation where <code>C</code> represents the
syntax of the program</li>
<li>But <code>[C] P Q</code> is a logical proposition expressed with the standard
higher-order connectives: <code>/\, \/, forall, exists</code>, etc.</li>
<li>Hence CF can be proved without involving external derivation rules</li>

</ul>
</section>
</section>
<section>
<section id="slide-org64af3d8">
<h2 id="org64af3d8">CFML</h2>
<ul>
<li>To generates characteristic formulae CFML uses neither knowledge of the
specification nor of the invariants of the source code</li>
<li>The specification of each top-level definition is instead provided by the
user, in the form of the statement of a Coq theorem</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgf463e31">
<h2 id="orgf463e31">CFML vs Ynot/HTT</h2>
<ul>
<li>Ynot/HTT: program verification is done at the same time as type-checking the
source code.</li>
<li>CF allow verifying programs after they have been written, without
requiring the source code to be modified in any way.</li>

</ul>
</section>
</section>
<section>
<section id="slide-org2d662d2">
<h2 id="org2d662d2">Side effects and Coq extraction</h2>
<ul>
<li>To get side effects in extracted code one can write an interpreter in the
target language that runs the verified part, using the power of the target
language to interact with the outside world via the console, filesystem,
network, etc.</li>
<li>A big disadvantage of extraction is performance. The source code is several
steps away from the extracted code and interpreter. This distance makes it
hard to debug performance problems and reduces control over what the
executable code does.</li>

</ul>
</section>
</section>
<section>
<section id="slide-org847b848">
<h2 id="org847b848">Monadic DSL for Mutable Arrays</h2>
<ul>
<li>Suppose we only care about array-based algorithms. This already covers a wide
area of algorithms, for example
<ul>
<li>the union–find data structure,</li>
<li>quicksort</li>

</ul></li>
<li>We can use a lightweight approach to formalizing imperative array-based algorithms</li>

</ul>
</section>
</section>
<section>
<section id="slide-org67f83fe">
<h2 id="org67f83fe">Monadic DSL for Mutable Arrays</h2>
<ul>
<li>This approach does not deal with reference cells and local states</li>
<li>Uses state monad specialized for mutable array programming</li>
<li>Two interpretations: for reasoning and program extraction</li>

</ul>
</section>
</section>
<section>
<section id="slide-org81e825c">
<h2 id="org81e825c">Monadic DSL for Mutable Arrays</h2>
<ul>
<li>Reduces reasoning on effectful programs to that of purely functional</li>
<li>Provides encapsulation function like <code>runST</code> of state threads</li>
<li>Convertts effectful functions written in the array state monad to referential
transparent functions and enables encapsulation of proofs.</li>

</ul>
</section>
</section>
<section>
<section id="slide-org66ead28">
<h2 id="org66ead28">Representing Mutable Arrays in Coq</h2>
<ul>
<li>State monad could be useful (<code>S -&gt; S * A</code>), but poses some problems we'd like to avoid</li>
<li>Array state monad to the rescue
<ul>
<li>handle multi-dimensional and multiple mutable arrays</li>
<li>never needs copy operations on arrays</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-orga06e69d">
<h2 id="orga06e69d">Representing Mutable Arrays in Coq</h2>
<ul>
<li>Finite functions <code>{ffun I1 * · · · * In -&gt; A}</code></li>
<li>Correspond to arrays of <code>A</code> indexed by <code>I1</code>,&#x2026;, <code>In</code></li>
<li>Monad transformers could handle multiple arrays</li>
<li>But voilate the copying restriction: composition of state monad transformer
and the non-determinism monad yields type <code>S -&gt; list (S * A)</code></li>

</ul>
</section>
</section>
<section>
<section id="slide-orgaa59724">
<h2 id="orgaa59724">Monadic DSL for Mutable Arrays</h2>
<div class="org-src-container">

<pre  class="src src-coq">AState <span style="color: #4f97d7;">[</span>:: <span style="color: #bc6ec5;">(</span>I1, T1<span style="color: #bc6ec5;">)</span>; ...; <span style="color: #bc6ec5;">(</span>In, Tn<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">]</span> A 
</pre>
</div>
<p>
Array state monad actions with <code>I1</code>, &#x2026;, <code>In</code> indexed mutable arrays of <code>T1</code>,
&#x2026;, <code>Tn</code> respectively and the return type <code>A</code>.
</p>
</section>
</section>
<section>
<section id="slide-orgf051b1e">
<h2 id="orgf051b1e">Monadic DSL for Mutable Arrays</h2>
<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Implicit Types</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">I J K</span> : finType<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">sig</span> : Sign<span style="color: #4f97d7;">)</span>.

<span style="color: #4f97d7; font-weight: bold;">Inductive</span> <span style="color: #bc6ec5; font-weight: bold;">AState</span> : Sign &#8594; <span style="color: #ce537a; font-weight: bold;">Type</span> &#8594; <span style="color: #ce537a; font-weight: bold;">Type</span> :=
| astate_ret_ : <span style="color: #ce537a; font-weight: bold;">&#8704;</span> <span style="color: #4f97d7;">{</span>sig<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>A<span style="color: #4f97d7;">}</span>,
    A -&gt; AState sig A
| astate_bind_ : <span style="color: #ce537a; font-weight: bold;">&#8704;</span> <span style="color: #4f97d7;">{</span>sig<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>A B<span style="color: #4f97d7;">}</span>,
    AState sig A -&gt;
    <span style="color: #4f97d7;">(</span>A -&gt; AState sig B<span style="color: #4f97d7;">)</span> -&gt;
    AState sig B
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org14b51f9">
<h2 id="org14b51f9">Monadic DSL for Mutable Arrays</h2>
<div class="org-src-container">

<pre  class="src src-coq">| astate_lift_ : <span style="color: #ce537a; font-weight: bold;">&#8704;</span><span style="color: #4f97d7;">{</span>I<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>T<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>sig<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>A<span style="color: #4f97d7;">}</span>,
   AState sig A -&gt;
   AState <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>I, T<span style="color: #bc6ec5;">)</span> :: sig<span style="color: #4f97d7;">)</span> A
</pre>
</div>
<p>
The lift operator lifts array state monad actions of a signature <code>Σ</code> to that
with a signature <code>(I,T)::Σ</code>, and lifted actions does not affect the first array.
</p>
</section>
</section>
<section>
<section id="slide-orgfac1591">
<h2 id="orgfac1591">Monadic DSL for Mutable Arrays</h2>
<div class="org-src-container">

<pre  class="src src-coq">| astate_GET_ : <span style="color: #ce537a; font-weight: bold;">&#8704;</span> <span style="color: #4f97d7;">{</span>I<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>T<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>sig<span style="color: #4f97d7;">}</span>,
   'I_#|I| -&gt;
   AState <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>I, T<span style="color: #bc6ec5;">)</span> :: sig<span style="color: #4f97d7;">)</span> T
| astate_SET_ : <span style="color: #ce537a; font-weight: bold;">&#8704;</span> <span style="color: #4f97d7;">{</span>I<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>T<span style="color: #4f97d7;">}</span> <span style="color: #4f97d7;">{</span>sig<span style="color: #4f97d7;">}</span>,
   'I_#|I| -&gt;
   T -&gt;
   AState <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>I, T<span style="color: #bc6ec5;">)</span> :: sig<span style="color: #4f97d7;">)</span> unit.
</pre>
</div>
<p>
Get and set operators can only access the first array.
</p>
</section>
</section>
